dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
/***************************************************************************//**
* \file cy_jwt_policy.c
* \version 1.0
*
* \brief
*  This is the source code for the JWT policy parsing and processing.
*
*****************************************?***************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include <string.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stddef.h>

#include "cy_syslib.h"
#include "cy_ipc_drv.h"

#include "mbedtls/ecdsa.h"
#include "mbedtls/oid.h"
#include "mbedtls/asn1.h"
#include "mbedtls/pk_internal.h"

#include "base64/base64.h"

#include "cy_jwt_policy.h"

/***************************************
* Macro definitions
***************************************/
#define CY_JWT_HASH_SIZE 32

#define CY_JWT_EC_KEY_CRV_FOUND		(1)
#define CY_JWT_EC_KEY_X_FOUND		(2)
#define CY_JWT_EC_KEY_Y_FOUND		(4)

#define JSON_MAX_DEPTH  (15)

/** Provisioning details SysCall opcode */
#define PROVDETAIL_SYSCALL_OPCODE       (0x37UL << 24UL)

/** PSA crypto SysCall return codes */
#define CY_FB_SYSCALL_SUCCESS           (0xA0000000UL)

/** SysCall timeout value */
#define SYSCALL_TIMEOUT                 (15000UL)

/* Uncomment to print validation debug messages */
/* #define JSON_SCHEMA_DBG */

/***************************************
* Data Structure definitions
***************************************/

enum cy_jwt_validation_error_codes
{
    CY_SCHEMA_VALID = 0,
    CY_SCHEMA_WRONG_TYPE = -1,
    CY_SCHEMA_MORE_THAN_MAX = -2,
    CY_SCHEMA_LESS_THAN_MIN = -3,
    CY_SCHEMA_WRONG_FORMAT = -4
};

/** Region names used in policy, must be in conformity with cy_jwt_smpu_reg_t enum */
const char *mem_region_names[POLICY_MAX_N_OF_PROT_REGIONS] =
{
    "FLASH_PC1_SPM", "FLASH_PC2", "FLASH_PC3", "FLASH_PC4",
    "FLASH_MAIN_CODE", "FLASH_MAIN_XO","FLASH_MAIN_DATA", "FLASH_SUPERVISORY",
    "FLASH_WORK_SECURE", "FLASH_WORK", "SRAM_PC0_PRIV", "SRAM_PC0_PUB",
    "SRAM_SPM_PRIV", "SRAM_SPM_PUB", "SRAM_PC1_PRIV", "SRAM_PC2_PRIV",
    "SRAM_PC3_PRIV", "SRAM_PC4_PRIV", "SRAM_MAIN", "SMIF_CODE",
    "SMIF_XO", "SMIF_DATA"
};

/*******************************************************************************
* Function Name: get_str_key_crv
****************************************************************************//**
* Converts string with EC key curve name to enum value.
*
* \param curve    The pointer to string defining curve type.
* \return Integer value corresponding to curve defined.
*******************************************************************************/
ec_curve_type Cy_JWT_GetStrKeyCrv(char *curve)
{
    ec_curve_type rc = EC_KEY_CRV_INV;

    if (curve != NULL)
    {
        if (0 == strcasecmp(curve, "P-256"))
        {
            rc = EC_CRV_P_256;
        }
/*        else
        if (!strcasecmp(alg, "another_name"))
        {
            rc = ANOTHER_ENUM_VALUE;
        }
*/
    }
    return rc;
}

/*******************************************************************************
* Function Name: get_b64_decode_len
****************************************************************************//**
* Function Calculates the buffer size required for decoded base64 string storage.
*
* \param base64_size Size of base64 string to be decoded.
* \return Returns required buffer size to store decoded Base64 string.
*******************************************************************************/
uint32_t Cy_JWT_GetB64DecodeLen(uint32_t base64_size)
{
    uint32_t out_len, rem;

    out_len = (base64_size*3);
    out_len /= 4;

    rem = (4-out_len%4);

    out_len = out_len + rem;

    return out_len;
}

/*******************************************************************************
* Function Name: get_b64_encode_len
****************************************************************************//**
* Calculates the buffer size required for string encoded into base64.
*
* \param raw_size Size of string to be encoded.
* \return Returns required buffer size to store encoded Base64 string.
*******************************************************************************/
uint32_t Cy_JWT_GetB64EncodeLen(uint32_t raw_size)
{
    uint32_t out_len;

    out_len = 4*raw_size;
    out_len = out_len/3;
    out_len = out_len+3;
    out_len = out_len & ~3;

    return out_len;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetParseEcKey
****************************************************************************//**
* Parses JWK which represents EC key.
*
* \param json   JSON object with a key.
* \param key    Composite type return variable where key will be stored.
* \return       Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_ParseEcKey(cJSON *json, ec_key_t *key)
{
    int rc = CY_JWT_ERR_JKEY_NOT_FOUND;
    uint32_t flags = 0;

    if(cJSON_Object == json->type)
    {
        cJSON *item = json->child;

        /* reset d-parameter in case we have private key */
        memset(key->d, 0, sizeof(key->d));

        while(NULL != item)
        {
            if((0 != item->string) && (cJSON_String == item->type))
            {
                if(0 == strcmp("crv", item->string))
                {
                    key->crv = Cy_JWT_GetStrKeyCrv(item->valuestring);
                    if(EC_KEY_CRV_INV != key->crv)
                    {
                        flags |= CY_JWT_EC_KEY_CRV_FOUND;
                    }
                    else
                    {   /* report unsupported curve early */
                        rc = CY_JWT_ERR_EC_KEY_CRV_INV;
                        break;
                    }
                }
                else
                if(0 == strcmp("d", item->string))
                {
                    rc = base64_decode((uint8_t*)item->valuestring, -1, (uint8_t*)key->d, KEY_XY_LENGTH, BASE64_URL_SAFE_CHARSET);
                    if(rc <= 0)
                    {   /* report Decode64 failure early */
                        break;
                    }
                    else
                    {
                        rc = CY_JWT_SUCCESS;
                    }
                }
                else
                if(0 == strcmp("x", item->string))
                {
                    rc = base64_decode((uint8_t*)item->valuestring, -1, (uint8_t*)key->x, KEY_XY_LENGTH, BASE64_URL_SAFE_CHARSET);
                    if(rc > 0)
                    {
                        flags |= CY_JWT_EC_KEY_X_FOUND;
                        rc = CY_JWT_SUCCESS;
                    }
                    else
                    {   /* report Decode64 failure early */
                        break;
                    }
                }
                else
                if(0 == strcmp("y", item->string))
                {
                    rc = base64_decode((uint8_t*)item->valuestring, -1, (uint8_t*)key->y, KEY_XY_LENGTH, BASE64_URL_SAFE_CHARSET);
                    if(rc > 0)
                    {
                        flags |= CY_JWT_EC_KEY_Y_FOUND;
                        rc = CY_JWT_SUCCESS;
                    }
                    else
                    {   /* report Decode64 failure early */
                        break;
                    }
                }
            }
            item = item->next;
        }

        if((CY_JWT_EC_KEY_CRV_FOUND|CY_JWT_EC_KEY_X_FOUND|CY_JWT_EC_KEY_Y_FOUND) != flags)
        {
            rc = CY_JWT_ERR_EC_KEY_NON_COMPLT;
        }
        else
        {
            rc = CY_JWT_SUCCESS;
        }
    }
    else
    {
        rc = CY_JWT_ERR_JSN_NONOBJ;
    }
    return rc;
}

