dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
/*******************************************************************************
* Function Name: Cy_JWT_GetParseStrByKey
****************************************************************************//**
* Looks for JSON item by key string. Operates only on one level of nesting.
* Expects input item to be object.
*
* \param json       JSON object for lookup.
* \param val_str    String-type return variable result of lookup will be stored.
* \param key_str    Key string to lookup value by it.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_ParseStrByKey(cJSON *json, char *val_str, char *key_str)
{
    int rc = CY_JWT_ERR_JKEY_NOT_FOUND;

    if(cJSON_Object == json->type)
    {
        cJSON *item = json->child;
        while(NULL != item)
        {
            if((0 != item->string) && (cJSON_String == item->type))
            {
                if(0 == strcmp(key_str, item->string))
                {
                    if((cJSON_String == item->type) && (0 != item->valuestring))
                    {
                        strcpy(val_str, item->valuestring);
                        rc = CY_JWT_SUCCESS;
                        break;
                    }
                }
            }
            item = item->next;
        }
    }
    else
    {
        rc = CY_JWT_ERR_JSN_NONOBJ;
    }
    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetParseHeaderAlg
****************************************************************************//**
* Looks for "alg" value inside given JSON (JWT packet header).
*
* \param json       JSON object for lookup.
* \param alg_str    Key string to lookup crypto key type by it.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_ParseHeaderAlg(cJSON *json, char *alg_str)
{
    int rc = CY_JWT_ERR_JKEY_NOT_FOUND;

    rc = Cy_JWT_ParseStrByKey(json, alg_str, "alg");

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetParseKeyKty
****************************************************************************//**
* Looks for "kty" value inside given JSON (JWT packet header).
*
* \param json       JSON object for lookup.
* \param kty_str    Key string to lookup by it.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_ParseKeyKty(cJSON *json, char *kty_str)
{
    int rc = CY_JWT_ERR_JKEY_NOT_FOUND;

    rc = Cy_JWT_ParseStrByKey(json, kty_str, "kty");

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_SplitParsedPolicy
****************************************************************************//**
* Searches for 3 sub-policies inside already parsed JSON-policy and
* saves pointers to them.
*
* \param policy       Policy JSON object for lookup.
* \param policy_set   Composite variable where pointers of corresponing sub-polices 
                      will be stored.
* \return             Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_PolicyParsedSplit(cJSON *policy, policy_set_t *policy_set)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *item;

    policy_set->root = policy;

    if(cJSON_Object == policy->type)
    {
        item = policy->child;
        while(NULL != item)
        {
            if(0 != item->string)
            {
                if(0 == strcmp("debug", item->string))
                {
                    policy_set->debug = item;
                }
                else if(0 == strcmp("wounding", item->string))
                {
                    policy_set->wounding = item;
                }
                else if(0 == strcmp("boot_upgrade", item->string))
                {
                    policy_set->boot = item;
                }
            }

            item = item->next;
        }
    }
    else
    {
        rc = CY_JWT_ERR_JSN_NONOBJ;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_IsJSONItemSimple
****************************************************************************//**
* Checks if JSON item has a simple type - number, boolean, string.
* 
* \param item     JSON object to check.
* \return Trivial TRUE/FALSE.
*******************************************************************************/
bool Cy_JWT_IsJsonItemSimple(cJSON *item)
{
    return ((cJSON_False == item->type) || (cJSON_True == item->type)
            || (cJSON_Number == item->type) || (cJSON_String == item->type)
            || (cJSON_NULL == item->type));
}

/*******************************************************************************
* Function Name: Cy_JWT_FindJSONItemByKey
****************************************************************************//**
* Finds item by key (name) in whole JSON.
* Key can be not unique so function returns first item with this key.
* 
* \param key      String key to lookup after.
* \param json     JSON object to check.
* \return         Returns pointer to JSON object found.
*******************************************************************************/
cJSON *Cy_JWT_FindJsonItemByKey(const char* key, cJSON *json)
{
    cJSON *item = NULL;
    cJSON *parent[JSON_MAX_DEPTH];
    uint32_t depth = 0;

    while(NULL != json)
    {
        if(0 != json->string && 0 == strcmp(key, json->string))
        {
            item = json;
            break;
        }

        if(NULL != json->child)
        {
            if(depth < JSON_MAX_DEPTH)
            {
                parent[depth++] = json;
                json = json->child;
            }
            else
            {
                break;
            }
        }
        else if(NULL != json->next)
        {
            json = json->next;
        }
        else if(0 == depth)
        {
            break;
        }
        else
        {
            while(depth > 0)
            {
                json = parent[--depth]->next;
                if(NULL != json)
                {
                    break;
                }
            }
        }
    }

    return item;
}

