dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
/*******************************************************************************
* Function Name: Cy_JWT_ValidateItemBySchema
****************************************************************************//**
* Validates single JSON item by looking for its constraints in schema.
* 
* \param item       Pointer to policy item in JSON format.
* \param parent     Pointer to parent of policy item in JSON format.
* \param schema     Pointer to policy template in JSON format.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_ValidateItemBySchema(cJSON *item, cJSON *parent, cJSON *schema)
{
    int rc = CY_SCHEMA_VALID;
    cJSON *parent_sch = NULL;
    cJSON *item_sch = NULL;
    cJSON *val_kwd = NULL;

    if(NULL != parent)
    {
        parent_sch = Cy_JWT_FindJsonItemByKey(parent->string, schema);
    }
    else
    {
        parent_sch = schema;
    }

    if(NULL != item->string)
    {
        item_sch = Cy_JWT_FindJsonItemByKey(item->string, parent_sch);
    }
    else
    {
        item_sch = parent_sch;
    }

    if((NULL != item_sch) && (cJSON_Object == item_sch->type))
    {
        val_kwd = item_sch->child;
        while(NULL != val_kwd)
        {
            if(0 == strcmp("type", val_kwd->string))
            {
                if(0 == strcmp("array", val_kwd->valuestring))
                {
                    val_kwd = Cy_JWT_FindJsonItemByKey("items", item_sch);
                    val_kwd = val_kwd->child;
                }
                else
                {
                    if(0 == strcmp("number", val_kwd->valuestring) &&
                            cJSON_Number != item->type)
                    {
                        rc = CY_SCHEMA_WRONG_TYPE;
                    }
                    else if(0 == strcmp("integer", val_kwd->valuestring) &&
                            cJSON_Number != item->type)
                    {
                        rc = CY_SCHEMA_WRONG_TYPE;
                    }
                    else if(0 == strcmp("boolean", val_kwd->valuestring) &&
                            (cJSON_False != item->type && cJSON_True != item->type))
                    {
                        rc = CY_SCHEMA_WRONG_TYPE;
                    }
                    else if(0 == strcmp("string", val_kwd->valuestring) &&
                            cJSON_String != item->type)
                    {
                        rc = CY_SCHEMA_WRONG_TYPE;
                    }

                    val_kwd = val_kwd->next;
                }
            }
            else if(0 == strcmp("maximum", val_kwd->string))
            {
                if(item->valueint > val_kwd->valueint)
                {
                    rc = CY_SCHEMA_MORE_THAN_MAX;
                }

                val_kwd = val_kwd->next;
            }
            else if(0 == strcmp("minimum", val_kwd->string))
            {
                if(item->valueint < val_kwd->valueint)
                {
                    rc = CY_SCHEMA_LESS_THAN_MIN;
                }

                val_kwd = val_kwd->next;
            }
            else if(0 == strcmp("oneOf", val_kwd->string))
            {
                val_kwd = val_kwd->next;
            }
            else if(0 == strcmp("allOf", val_kwd->string))
            {
                val_kwd = val_kwd->next;
            }
            else
            {
                val_kwd = val_kwd->next;
            }

            if(CY_SCHEMA_VALID != rc)
            {
                break;
            }
        }
    }
    else
    {
        rc = CY_SCHEMA_WRONG_FORMAT;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_ValidateSinglePolicyBySchema
****************************************************************************//**
* Validates JSON-policy using correspondent JSON-schema.
* 
* \param json       JSON object to be validated.
* \param schema     Schema JSON to as a validation template.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_PolicySingleValidateBySchema(cJSON *json, cJSON *schema)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *item;
    cJSON *parents[JSON_MAX_DEPTH];
    uint32_t depth = 0;

    if(cJSON_Object == json->type)
    {
        item = json->child;
        while(NULL != item)
        {
            if(Cy_JWT_IsJsonItemSimple(item))
            {
                /* Validate item */
                cJSON *parent;
                if(0 == depth)
                {
                    parent = NULL;
                }
                else if(cJSON_Object == parents[depth-1]->type && 0 == parents[depth-1]->string)
                {
                    parent = parents[depth-2];
                }
                else
                {
                    parent = parents[depth-1];
                }

                rc = Cy_JWT_ValidateItemBySchema(item, parent, schema);
                if(CY_SCHEMA_VALID != rc)
                {
#if !defined(JSON_SCHEMA_DBG)
                    rc = CY_JWT_ERR_TEMPL_VALID_FAIL;
                    break;
#endif
                }

#if defined(JSON_SCHEMA_DBG)
                char *value = cJSON_Print(item);
                printf("%s : %s = %i\r\n", 0 == item->string ? "*" : item->string, value, rc);
                free(value);
#endif
            }

            if(NULL != item->child)
            {
                if(depth < JSON_MAX_DEPTH)
                {
                    parents[depth++] = item;
                    item = item->child;
                }
                else
                {
                    rc = CY_JWT_ERR_JSN_BIG_NESTING;
                    break;
                }
            }
            else if(NULL != item->next)
            {
                item = item->next;
            }
            else if(0 == depth)
            {
                break;
            }
            else
            {
                while(depth > 0)
                {
                    item = parents[--depth]->next;
                    if(NULL != item)
                    {
                        break;
                    }
                }
            }
        }
    }
    else
    {
        rc = CY_JWT_ERR_JSN_NONOBJ;
    }

#if defined(JSON_SCHEMA_DBG)
    printf("\r\n");
#endif

