dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetHeadStrData
****************************************************************************//**
* Looks over given JWT packet, find where JWT header is located 
* and what length of it is.
* 
* \param jwt_str    JWT packet to analyze.
* \param header_ptr Pointer to JWT header section.
* \param header_len Length of JWT header section.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_GetStrDataHead(char *jwt_str, char **header_ptr, uint32_t *header_len)
{
    int ret = CY_JWT_SUCCESS;
    char *ptr;

    ptr = strchr(jwt_str, '.');

    if(NULL != ptr)
    {
        *header_len = ptr-jwt_str;
        *header_ptr = jwt_str;
    }
    else
    {
        ret = CY_JWT_ERR_JWT_BROKEN_FORMAT;
    }
    return ret;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetBodyStrData
****************************************************************************//**
* Looks over given JWT packet, find where JWT body is located 
* and what length of it is.
* 
* \param jwt_str  JWT packet to analyze.
* \param body_ptr Pointer to JWT body section.
* \param body_len Length of JWT header section.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_GetStrDataBody(char *jwt_str, char **body_ptr, uint32_t *body_len)
{
    int ret = CY_JWT_SUCCESS;
    char *ptrStart;
    char *ptrEnd;

    ptrStart = strchr(jwt_str, '.');
    if(NULL != ptrStart)
    {
        ptrEnd = strchr(ptrStart+1, '.');
        if(NULL != ptrEnd)
        {
            *body_len = ptrEnd-ptrStart-1;
            *body_ptr = ptrStart+1;
        }
        else
        {
            ret = CY_JWT_ERR_JWT_BROKEN_FORMAT;
        }
    }
    else
    {
        ret = CY_JWT_ERR_JWT_BROKEN_FORMAT;
    }
    return ret;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetSigStrData
****************************************************************************//**
* Looks over given JWT packet, find where JWT signature is located 
* and what length of it is.
* 
* \param jwt_str  JWT packet to analyze.
* \param sig_ptr Pointer to JWT signature section.
* \param sig_len Length of JWT signature section.
* \return           Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_GetStrDataSig(char *jwt_str, char **sig_ptr, uint32_t *sig_len)
{
    int ret = CY_JWT_SUCCESS;
    char *ptrStart;

    ptrStart = strchr(jwt_str, '.');
    if(NULL != ptrStart)
    {
        ptrStart = strchr(ptrStart+1, '.');
        if(NULL != ptrStart)
        {
            *sig_len = strlen(ptrStart+1);
            *sig_ptr = ptrStart+1;
        }
        else
        {
            ret = CY_JWT_ERR_JWT_BROKEN_FORMAT;
        }
    }
    else
    {
        ret = CY_JWT_ERR_JWT_BROKEN_FORMAT;
    }
    return ret;
}

/*******************************************************************************
* Function Name: Cy_JWT_CheckHeadValid
****************************************************************************//**
* Checks if given JWT packet has valid header.
* 
* \param jwt_packet   JWT packet where header has to be validated.
* \param alg          Expected algorithm.
* \return             Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_IsHeadValid(char *jwt_packet, char *alg)
{
    int ret = CY_JWT_SUCCESS;

    char *json_payload;
    char *ptr;

    uint32_t payload_len;
    uint32_t json_len;

    /* look for <head.body> */
    ret = Cy_JWT_GetStrDataHead(jwt_packet, &ptr, &payload_len);

    if (CY_JWT_SUCCESS == ret)
    {
        /* estimate decode64 output buffer size */
        json_len = Cy_JWT_GetB64DecodeLen(payload_len);
        json_payload = malloc(json_len);

        if(NULL != json_payload)
        {
            ret = base64_decode((uint8_t*)ptr, payload_len, (uint8_t*)json_payload, json_len, BASE64_URL_SAFE_CHARSET);
            /* if head decoded-64 successfully */
            if(ret > 0)
            {
                cJSON_InitHooks(NULL);
                cJSON *json_data = cJSON_Parse(json_payload);

                ret = Cy_JWT_ParseHeaderAlg(json_data, alg);

                cJSON_Delete(json_data);
            }
            else
            {
                ret = CY_JWT_ERR_B64DECODE_FAIL;
            }
            free(json_payload);
        }
        else
        {
            ret = CY_JWT_ERR_JWT_MALLOC_FAIL;
        }
    }
    else
    {
        ret = CY_JWT_ERR_JWT_PACKET_PARSE;
    }
    return ret;
}

/*******************************************************************************
* Function Name: Cy_JWT_ValidateBySchema
****************************************************************************//**
* Validates JSON-policy which consist of 3 sub-policies using set of 3 JSON-schemas.
* 
* \param policy_str  Pointer to string that contains policy.
* \param templates   Pointer to structure that contains policy template strings.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_PolicyValidateBySchema(char *policy_str, schema_set_t *templates)
{
    int rc = CY_JWT_SUCCESS;
    policy_set_t policy_set;
    cJSON *policy = NULL;
    cJSON *schema = NULL;

    cJSON_InitHooks(NULL);

    policy = cJSON_Parse(policy_str);
    if(NULL != policy)
    {
        rc = Cy_JWT_PolicyParsedSplit(policy, &policy_set);

        if(CY_JWT_SUCCESS == rc)
        {
            schema = cJSON_Parse(templates->debug);
            if(NULL != schema)
            {
                rc = Cy_JWT_PolicySingleValidateBySchema(policy_set.debug, schema);
                cJSON_Delete(schema);
            }
            else
            {
                rc = CY_JWT_ERR_JSN_PARSE_FAIL;
            }
        }

        if(CY_JWT_SUCCESS == rc)
        {
            schema = cJSON_Parse(templates->wounding);
            if(NULL != schema)
            {
                rc = Cy_JWT_PolicySingleValidateBySchema(policy_set.wounding, schema);
                cJSON_Delete(schema);
            }
            else
            {
                rc = CY_JWT_ERR_JSN_PARSE_FAIL;
            }
        }

        if(CY_JWT_SUCCESS == rc)
        {
            schema = cJSON_Parse(templates->boot);
            if(NULL != schema)
            {
                rc = Cy_JWT_PolicySingleValidateBySchema(policy_set.boot, schema);
                cJSON_Delete(schema);
            }
            else
            {
                rc = CY_JWT_ERR_JSN_PARSE_FAIL;
            }
        }

        cJSON_Delete(policy);
    }
    else
    {
        rc = CY_JWT_ERR_JSN_PARSE_FAIL;
    }

