dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_SplitPolicy
****************************************************************************//**
* Takes whole JSON-policy string and returns pointers to 3 parsed sub-policies.
* Note: policy_set.root must be freed after.
*
* USAGE MODEL:
*
* Cy_JWT_SplitPolicy(&policy_set);
* ...
* some_useful_code(&policy_set);
* ...
* cJSON_Delete(policy_set.root);
* 
* \param policy_str  Pointer to string that contains policy.
* \param policy_set  Pointer to structure that contains parsed policy.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_PolicyPackageSplit(char *policy_str, policy_set_t *policy_set)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *policy = NULL;

    cJSON_InitHooks(NULL);

    policy = cJSON_Parse(policy_str);
    if(NULL != policy)
    {
        rc = Cy_JWT_PolicyParsedSplit(policy, policy_set);
    }
    else
    {
        rc = CY_JWT_ERR_JSN_PARSE_FAIL;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetProtRegionCode
****************************************************************************//**
* Helper function, analyzes protection region name and returns its numerical
* representation.
*
* \param name         Name of protected region.
* \param code         Numerical representation of protected region.
* \return             Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
static int Cy_JWT_GetProtRegionCode(const char* name, int *code)
{
    int rc = CY_JWT_SUCCESS;
    int i;

    if((NULL == name) || (NULL == code))
    {
        rc = CY_JWT_ERR_JSN_PARSE_FAIL;
    }
    else
    {
        for(i = 0; i < POLICY_MAX_N_OF_PROT_REGIONS; i++)
        {
            if(0 == strcmp(name, mem_region_names[i]))
            {
                *code = i;
                break;
            }
        }

        if(POLICY_MAX_N_OF_PROT_REGIONS == i)
        {
            rc = CY_JWT_ERR_JSN_PARSE_FAIL;
        }
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetProtRegionSize
****************************************************************************//**
* Helper function, analyzes protection region size in bytes and returns
* its code suitable to use with Cypress protection unit structure.
* 
* \param  size        Protection region size in bytes.
* \return code        Size code for protection unit structure.
*******************************************************************************/
int Cy_JWT_GetProtRegionSize(uint64_t size)
{
    int code = -1;
    uint32_t limit = 4; /* 4 bytes is lower possible memory size to protect */
    int i;
    const int max_shift = 29; /* 4 << 29 = 0x80000000 */

    for(i = 0; i < max_shift; i++)
    {
        if(size > limit)
        {
            limit <<= 1;
        }
        else
        {
            code = i+1;
            break;
        }
    }

    if(max_shift == i)
    {
        code = i+2;
    }

    return code;
}

/*******************************************************************************
* Function Name: Cy_JWT_ParseBnUPolicyResources
****************************************************************************//**
* Takes list of images configuration from parsed BnU policy and
* looks for used resources to configure protections.
* 
* \param bnu_json    Pointer to parsed policy.
* \param bnu_policy  Pointer to structure that contains policy in binary 
*                    representation.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
static int Cy_JWT_ParseBnUPolicyResources(cJSON *bnu_json, bnu_policy_t *bnu_policy)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *image = bnu_json;
    cJSON *item = NULL;
    cJSON *res = NULL;
    int region = 0;
    int size = 0;
    uint32_t address = 0;

    while(NULL != image)
    {
        item = Cy_JWT_FindJsonItemByKey("resources", image);
        if(NULL != item)
        {
            res = item->child;
            while(NULL != res)
            {
                item = Cy_JWT_FindJsonItemByKey("type", res);
                if(NULL != item)
                {
                	/* if resources are NOT flashmap-related */
					if((0 != strcmp(item->valuestring, "BOOT"))&&
						(0 != strcmp(item->valuestring, "UPGRADE")))
					{
						rc = Cy_JWT_GetProtRegionCode(item->valuestring, &region);
						if(0 != rc)
						{
							region = -1;
						}

		                item = Cy_JWT_FindJsonItemByKey("address", res);
		                if(NULL != item)
		                {
		                    address = item->valueint;
		                }

		                item = Cy_JWT_FindJsonItemByKey("size", res);
		                if(NULL != item)
		                {
		                    size = Cy_JWT_GetProtRegionSize(item->valueint);
		                }

		                if((region >= 0) && (size > 0))
		                {
		                    if(1 == bnu_policy->present.prot_regions[region].start)
		                    {
		                        bnu_policy->prot_regions[region].start = address;
		                    }

		                    if(1 == bnu_policy->present.prot_regions[region].size)
		                    {
		                        bnu_policy->prot_regions[region].size = size;
		                    }
		                }
					}
                }
                res = res->next;
            }
        }
        image = image->next;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_ParseBnUPolicyFlashMap
****************************************************************************//**
* Takes list of images configuration from parsed BnU policy and
* looks for flash map configuration.
*
* \param bnu_json    Pointer to parsed policy.
* \param bnu_policy  Pointer to structure that contains policy in binary
*                    representation.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
static int Cy_JWT_ParseBnUPolicyFlashMap(cJSON *bnu_json, bnu_policy_t *bnu_policy)
{
	 int rc = CY_JWT_SUCCESS;
	cJSON *image = bnu_json;
	cJSON *item = NULL;
	cJSON *res = NULL;
	int region = 0;
	int size = 0;
	uint32_t address = 0;

	if(NULL != image)
	{
		item = Cy_JWT_FindJsonItemByKey("resources", image);
		if(NULL != item)
		{
			res = item->child;
			while(NULL != res)
			{
				item = Cy_JWT_FindJsonItemByKey("type", res);
				if(NULL != item)
				{
					/* if resource is FlashMap-related */
					if(0 == strcmp(item->valuestring, "BOOT"))
					{
						item = Cy_JWT_FindJsonItemByKey("address", res);
						if(NULL != item)
						{
							if(1 == bnu_policy->present.bnu_img_policy.boot_area.start)
							{
								bnu_policy->bnu_img_policy.boot_area.start = item->valueint;
							}
						}

						item = Cy_JWT_FindJsonItemByKey("size", res);
						if(NULL != item)
						{
							if(1 == bnu_policy->present.bnu_img_policy.boot_area.size)
							{
								bnu_policy->bnu_img_policy.boot_area.size = item->valueint;
							}
						}
					}
					else /* if resource is FlashMap-related */
					if(0 == strcmp(item->valuestring, "UPGRADE"))
					{
						item = Cy_JWT_FindJsonItemByKey("address", res);
						if(NULL != item)
						{
							if(1 == bnu_policy->present.bnu_img_policy.upgrade_area.start)
							{
								bnu_policy->bnu_img_policy.upgrade_area.start = item->valueint;
							}
						}

						item = Cy_JWT_FindJsonItemByKey("size", res);
						if(NULL != item)
						{
							if(1 == bnu_policy->present.bnu_img_policy.upgrade_area.start)
							{
								bnu_policy->bnu_img_policy.upgrade_area.size = item->valueint;
							}
						}
					}
				}
				res = res->next;
			}
		}
	}

