dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
	return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetParseBnUPolicy
****************************************************************************//**
* Takes parsed BnU policy, looks for items and stores them into structure.
* Assumes that image ID is already in BnU structure.
* 
* \param bnu_json    Pointer to parsed policy.
* \param bnu_policy  Pointer to structure that contains policy in binary 
*                    representation.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_BnUPolicyParse(cJSON *bnu_json, bnu_policy_t *bnu_policy, uint32_t masterImgID)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *policy = NULL;
    cJSON *policyRec = NULL;
    cJSON *item = NULL;
    uint8_t id = 0;

    /* Analyze 'image' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("firmware", bnu_json);
    if(NULL != policy)
    {
        policy = policy->child;

        rc = Cy_JWT_ParseBnUPolicyResources(policy, bnu_policy);

        policyRec = policy;
        /* Looking for master image ID */
        if(cJSON_Object == policy->type)
        {
            while(NULL != policy)
            {
                item = Cy_JWT_FindJsonItemByKey("id", policy);
                if(NULL != policy)
                {
                    id = item->valueint;
                    if(id == masterImgID)
                    {
						item = Cy_JWT_FindJsonItemByKey("launch", policy);
						bnu_policy->bnu_img_policy.id = item->valueint;
						break;
                    }
                }
                policy = policy->next;
            }
        }
        /* return to the beginning */
        policy = policyRec;
        if(cJSON_Object == policy->type)
        {
            while(NULL != policy)
            {
                item = Cy_JWT_FindJsonItemByKey("id", policy);
                if(NULL != policy)
                {
                    id = item->valueint;
                    if(id == bnu_policy->bnu_img_policy.id)
                    {
                        break;
                    }
                }
                policy = policy->next;
            }

            rc = Cy_JWT_ParseBnUPolicyFlashMap(policy, bnu_policy);

            item = Cy_JWT_FindJsonItemByKey("monotonic", policy);
            if(NULL != item)
            {
                if(1 == bnu_policy->present.bnu_img_policy.monotonic)
                {
                    bnu_policy->bnu_img_policy.monotonic = item->valueint;
                }
            }

            item = Cy_JWT_FindJsonItemByKey("upgrade", policy);
            if(NULL != item)
            {
                if(1 == bnu_policy->present.bnu_img_policy.upgrade)
                {
                    bnu_policy->bnu_img_policy.upgrade = item->type;
                }
            }

            item = Cy_JWT_FindJsonItemByKey("encrypt", policy);
            if(NULL != item)
            {
                if(1 == bnu_policy->present.bnu_img_policy.encrypt)
                {
                    bnu_policy->bnu_img_policy.encrypt = item->type;
                }
            }

            item = Cy_JWT_FindJsonItemByKey("encrypt_key_id", policy);
            if(NULL != item)
            {
                if(1 == bnu_policy->present.bnu_img_policy.encrypt)
                {
                    bnu_policy->bnu_img_policy.encrypt_key_id = item->valueint;
                }
            }

            item = Cy_JWT_FindJsonItemByKey("backup", policy);
            if(NULL != item)
            {
                if(1 == bnu_policy->present.bnu_img_policy.backup)
                {
                    bnu_policy->bnu_img_policy.backup = item->type;
                }
            }

            item = Cy_JWT_FindJsonItemByKey("boot_auth", policy);
            if(NULL != item && cJSON_Array == item->type)
            {
                item = item->child;
                for(int i = 0; i < POLICY_MAX_N_OF_KEYS; i++)
                {
                    if(NULL != item)
                    {
                        if(1 == bnu_policy->present.bnu_img_policy.boot_auth[i])
                        {
                            bnu_policy->bnu_img_policy.boot_auth[i] = item->valueint;
                        }
                        item = item->next;
                    }
                    else
                    {
                        break;
                    }
                }
            }

            item = Cy_JWT_FindJsonItemByKey("upgrade_auth", policy);
            if(NULL != item && cJSON_Array == item->type)
            {
                item = item->child;
                for(int i = 0; i < POLICY_MAX_N_OF_KEYS; i++)
                {
                    if(NULL != item)
                    {
                        if(1 == bnu_policy->present.bnu_img_policy.upgrade_auth[i])
                        {
                            bnu_policy->bnu_img_policy.upgrade_auth[i] = item->valueint;
                        }
                        item = item->next;
                    }
                    else
                    {
                        break;
                    }
                }
            }
        }
    }

    /* Analyze 'reprogramming' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("reprogram", bnu_json);
    if(NULL != policy)
    {
        policy = policy->child;
        for(int i = 0; i < POLICY_MAX_N_OF_REPROG_REGIONS; i++)
        {
            if(NULL != policy)
            {
                item = Cy_JWT_FindJsonItemByKey("size", policy);
                if(NULL != item)
                {
                    if(1 == bnu_policy->present.bnu_reprog_policy[i].size)
                    {
                        bnu_policy->bnu_reprog_policy[i].size = item->valueint;
                    }
                }

                item = Cy_JWT_FindJsonItemByKey("start", policy);
                if(NULL != item)
                {
                    if(1 == bnu_policy->present.bnu_reprog_policy[i].start)
                    {
                        bnu_policy->bnu_reprog_policy[i].start = item->valueint;
                    }
                }
                policy = policy->next;
            }
            else
            {
                break;
            }
        }
    }

    /* Analyze 'reprovisioning' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("reprovision", bnu_json);
    if(NULL != policy)
    {
        item = Cy_JWT_FindJsonItemByKey("boot_loader", policy);
        if(NULL != item)
        {
            if(1 == bnu_policy->present.bnu_reprov_policy.boot_loader)
            {
                bnu_policy->bnu_reprov_policy.boot_loader = item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("keys_and_policies", policy);
        if(NULL != item)
        {
            if(1 == bnu_policy->present.bnu_reprov_policy.keys_n_pol)
            {
                bnu_policy->bnu_reprov_policy.keys_n_pol = item->type;
            }
        }
    }

