dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetParseWoundPolicy
****************************************************************************//**
* Takes parsed Wounding policy, looks for items and stores them into structure.
* 
* \param wound_json     Pointer to parsed policy.
* \param wound_policy   Pointer to structure that contains policy in binary 
*                       representation.
* \return               Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_WoundPolicyParse(cJSON *wound_json, wound_policy_t *wound_policy)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *policy = NULL;
    cJSON *item = NULL;

    /* Analyze 'peripherals' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("peripherals", wound_json);
    if(NULL != policy)
    {
        policy = policy->child;
        for(int i = 0; i < POLICY_MAX_N_OF_PERIPH; i++)
        {
            if(NULL != policy)
            {
                item = Cy_JWT_FindJsonItemByKey("id", policy);
                if(NULL != item)
                {
                    if(1 == wound_policy->present.periph_policy[i].id)
                    {
                        wound_policy->periph_policy[i].id = item->valueint;
                    }
                }

                item = Cy_JWT_FindJsonItemByKey("base_address", policy);
                if(NULL != item)
                {
                    if(1 == wound_policy->present.periph_policy[i].base_address)
                    {
                        wound_policy->periph_policy[i].base_address = item->valueint;
                    }
                }
                policy = policy->next;
            }
            else
            {
                break;
            }
        }
    }

    /* Analyze 'memories' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("memories", wound_json);
    if(NULL != policy)
    {
        item = Cy_JWT_FindJsonItemByKey("flash", policy);
        if(NULL != item)
        {
            if(1 == wound_policy->present.mem_policy.flash)
            {
                wound_policy->mem_policy.flash = (bool)item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("workflash", policy);
        if(NULL != item)
        {
            if(1 == wound_policy->present.mem_policy.workflash)
            {
                wound_policy->mem_policy.workflash = (bool)item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("sflash", policy);
        if(NULL != item)
        {
            if(1 == wound_policy->present.mem_policy.sflash)
            {
                wound_policy->mem_policy.sflash = (bool)item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("sram", policy);
        if(NULL != item)
        {
            if(1 == wound_policy->present.mem_policy.sram)
            {
                wound_policy->mem_policy.sram = (bool)item->type;
            }
        }
    }

    /* Analyze 'software' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("software", wound_json);
    if(NULL != policy)
    {
        policy = policy->child;
        for(int i = 0; i < POLICY_MAX_N_OF_SW; i++)
        {
            if(NULL != policy)
            {
                item = Cy_JWT_FindJsonItemByKey("id", policy);
                if(NULL != item)
                {
                    if(1 == wound_policy->present.soft_policy[i].id)
                    {
                        wound_policy->soft_policy[i].id = item->valueint;
                    }
                }

                item = Cy_JWT_FindJsonItemByKey("capability", policy);
                if(NULL != item)
                {
                    if(1 == wound_policy->present.soft_policy[i].capability)
                    {
                        wound_policy->soft_policy[i].capability = item->valueint;
                    }
                }
                policy = policy->next;
            }
            else
            {
                break;
            }
        }
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetPermissionCode
****************************************************************************//**
* Takes permission policy string and returns corresponding enum value.
* 
* \param str  Permission policy string.
* \return     Permission policy enum value.
*******************************************************************************/
static perm_policy_t Cy_JWT_GetPermissionCode(const char *str)
{
    perm_policy_t p = PERM_DISABLED;

    if(0 == strcmp("disabled", str))
    {
        p = PERM_DISABLED;
    }
    else if(0 == strcmp("enabled", str))
    {
        p = PERM_ENABLED;
    }
    else if(0 == strcmp("allowed", str))
    {
        p = PERM_ALLOWED;
    }

    return p;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetControlCode
****************************************************************************//**
* Takes control policy string and returns corresponding enum value.
* 
* \param str  Control policy string.
* \return     Control policy enum value.
*******************************************************************************/
static contrl_policy_t Cy_JWT_GetControlCode(const char *str)
{
    contrl_policy_t c = CONTRL_FIRMWARE;

    if(0 == strcmp("firmware", str))
    {
        c = CONTRL_FIRMWARE;
    }
    else if(0 == strcmp("certificate", str))
    {
        c = CONTRL_CERT;
    }
    else if(0 == strcmp("open", str))
    {
        c = CONTRL_OPEN;
    }

    return c;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetParseDebugPolicy
****************************************************************************//**
* Takes parsed Debug policy, looks for items and stores them into structure.
* 
* \param debug_json     Pointer to parsed policy.
* \param debug_policy   Pointer to structure that contains policy in binary 
*                       representation.
* \return               Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_DebugPolicyParse(cJSON *debug_json, debug_policy_t *debug_policy)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *policy = NULL;
    cJSON *item = NULL;
    cJSON *array = NULL;

    /* Analyze 'm0p' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("m0p", debug_json);
    if(NULL != policy)
    {
        item = Cy_JWT_FindJsonItemByKey("permission", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.m0p_policy.permission)
            {
                debug_policy->m0p_policy.permission =
                    Cy_JWT_GetPermissionCode((const char*)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("control", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.m0p_policy.control)
            {
                debug_policy->m0p_policy.control =
                    Cy_JWT_GetControlCode((const char *)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("key", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.m0p_policy.key)
            {
                debug_policy->m0p_policy.key = item->valueint;
            }
        }
    }

    /* Analyze 'm4' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("m4", debug_json);
    if(NULL != policy)
    {
        item = Cy_JWT_FindJsonItemByKey("permission", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.m4_policy.permission)
            {
                debug_policy->m4_policy.permission =
                    Cy_JWT_GetPermissionCode((const char*)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("control", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.m4_policy.control)
            {
                debug_policy->m4_policy.control =
                    Cy_JWT_GetControlCode((const char *)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("key", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.m4_policy.key)
            {
                debug_policy->m4_policy.key = item->valueint;
            }
        }
    }

    /* Analyze 'system' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("system", debug_json);
    if(NULL != policy)
    {
        item = Cy_JWT_FindJsonItemByKey("permission", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.permission)
            {
                debug_policy->sys_policy.permission =
                    Cy_JWT_GetPermissionCode((const char*)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("control", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.control)
            {
                debug_policy->sys_policy.control =
                    Cy_JWT_GetControlCode((const char *)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("key", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.key)
            {
                debug_policy->sys_policy.key = item->valueint;
            }
        }

