dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
        item = Cy_JWT_FindJsonItemByKey("syscall", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.syscall)
            {
                debug_policy->sys_policy.syscall = item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("mmio", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.mmio)
            {
                debug_policy->sys_policy.mmio = item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("flash", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.flash)
            {
                debug_policy->sys_policy.flash = item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("workflash", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.workflash)
            {
                debug_policy->sys_policy.workflash = item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("sflash", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.sflash)
            {
                debug_policy->sys_policy.sflash = item->type;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("sram", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.sys_policy.sram)
            {
                debug_policy->sys_policy.sram = item->type;
            }
        }
    }

    /* Analyze 'rma' part of policy */
    policy = Cy_JWT_FindJsonItemByKey("rma", debug_json);
    {
        item = Cy_JWT_FindJsonItemByKey("permission", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.rma_policy.permission)
            {
                debug_policy->rma_policy.permission =
                    Cy_JWT_GetPermissionCode((const char*)item->valuestring);
            }
        }

        item = Cy_JWT_FindJsonItemByKey("key", policy);
        if(NULL != item)
        {
            if(1 == debug_policy->present.rma_policy.key)
            {
                debug_policy->rma_policy.key = item->valueint;
            }
        }

        item = Cy_JWT_FindJsonItemByKey("destroy_fuses", policy);
        if(NULL != item)
        {
            array = item->child;
            for(int i = 0; i < POLICY_MAX_N_OF_DESTR_REGIONS; i++)
            {
                if(NULL != array)
                {
                    item = Cy_JWT_FindJsonItemByKey("start", array);
                    if(NULL != item)
                    {
                        if(1 == debug_policy->present.rma_policy.destroy_fuses[i].start)
                        {
                            debug_policy->rma_policy.destroy_fuses[i].start = item->valueint;
                        }
                    }

                    item = Cy_JWT_FindJsonItemByKey("size", array);
                    if(NULL != item)
                    {
                        if(1 == debug_policy->present.rma_policy.destroy_fuses[i].size)
                        {
                            debug_policy->rma_policy.destroy_fuses[i].size = item->valueint;
                        }
                    }
                    array = array->next;
                }
                else
                {
                    break;
                }
            }
        }

        item = Cy_JWT_FindJsonItemByKey("destroy_flash", policy);
        if(NULL != item)
        {
            array = item->child;
            for(int i = 0; i < POLICY_MAX_N_OF_DESTR_REGIONS; i++)
            {
                if(NULL != array)
                {
                    item = Cy_JWT_FindJsonItemByKey("start", array);
                    if(NULL != item)
                    {
                        if(1 == debug_policy->present.rma_policy.destroy_flash[i].start)
                        {
                            debug_policy->rma_policy.destroy_flash[i].start = item->valueint;
                        }
                    }

                    item = Cy_JWT_FindJsonItemByKey("size", array);
                    if(NULL != item)
                    {
                        if(1 == debug_policy->present.rma_policy.destroy_flash[i].size)
                        {
                            debug_policy->rma_policy.destroy_flash[i].size = item->valueint;
                        }
                    }
                    array = array->next;
                }
                else
                {
                    break;
                }
            }
        }
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_FindDefaultValueInTemplate
****************************************************************************//**
* Find default value for single item in policy template
* 
* \param key  Name of the policy item which default value is looked for.
* \param json Pointer to JSON item which default value is looked for.
* \return     Pointer to JSON item that contains default value of given policy 
*             item.
*******************************************************************************/
cJSON *Cy_JWT_FindDefaultValueInTemplate(const char *key, cJSON *json)
{
    cJSON *def = NULL;
    cJSON *item = NULL;
    cJSON *type = NULL;
    char def_key[20];

    memset(def_key, 0, sizeof(def_key));

    item = Cy_JWT_FindJsonItemByKey(key, json);
    while(NULL != item)
    {
        type = Cy_JWT_FindJsonItemByKey("type", item);
        if(NULL != type)
        {
            if(0 != type->valuestring && 0 == strcmp("string", type->valuestring))
            {
                strcpy(def_key, "string");
            }
            else if(0 != type->valuestring && 0 == strcmp("number", type->valuestring))
            {
                strcpy(def_key, "number");
            }
            else if(0 != type->valuestring && 0 == strcmp("integer", type->valuestring))
            {
                strcpy(def_key, "number");
            }
            else if(0 != type->valuestring && 0 == strcmp("boolean", type->valuestring))
            {
                strcpy(def_key, "boolean");
            }
            else if(0 != type->valuestring && 0 == strcmp("array", type->valuestring))
            {
                item = Cy_JWT_FindJsonItemByKey("items", item);
                continue;
            }

            def = Cy_JWT_FindJsonItemByKey((const char*)def_key, item);
            item = NULL;
        }
    }

    return def;
}

