dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
/*******************************************************************************
* Function Name: Cy_JWT_FindPresentValueInTemplate
****************************************************************************//**
* Find 'present' property value for single item in policy template
*
* \param key  Name of the policy item which 'present' value is looked for.
* \param json Pointer to JSON item which 'present' value is looked for.
* \return     Value of the 'present' property.
*******************************************************************************/
uint8_t Cy_JWT_FindPresentValueInTemplate(const char *key, cJSON *json)
{
    uint8_t present_val = 1;
    cJSON *item = NULL;
    cJSON *present = NULL;
    char def_key[20];

    memset(def_key, 0, sizeof(def_key));

    item = Cy_JWT_FindJsonItemByKey(key, json);
    if((NULL != item) && (NULL != item->child))
    {
        present = Cy_JWT_FindJsonItemByKey("present", item->child);
        if(NULL != present)
        {
            present_val = present->type;
        }
    }

    return present_val;
}

/*******************************************************************************
* Function Name: Cy_JWT_DefaultDebugPolicy
****************************************************************************//**
* Set Debug policy structure to default values using corresponding template
* 
* \param schema_str  Schema policy template with default values.
* \param debug_policy  Debug policy to be initialized.
* \return              Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_DebugPolicySetDefault(const char *schema_str, debug_policy_t *debug_policy)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *schema = NULL;
    cJSON *item = NULL;
    cJSON *array = NULL;
    cJSON *def = NULL;
    uint8_t present;

    cJSON_InitHooks(NULL);

    schema = cJSON_Parse(schema_str);
    if(NULL != schema)
    {
        item = Cy_JWT_FindJsonItemByKey("m0p", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("permission", item);
            present = Cy_JWT_FindPresentValueInTemplate("permission", item);
            if(NULL != def)
            {
                debug_policy->m0p_policy.permission =
                        Cy_JWT_GetPermissionCode((const char *)def->valuestring);
                debug_policy->present.m0p_policy.permission = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("control", item);
            present = Cy_JWT_FindPresentValueInTemplate("control", item);
            if(NULL != def)
            {
                debug_policy->m0p_policy.control =
                        Cy_JWT_GetControlCode((const char *)def->valuestring);
                debug_policy->present.m0p_policy.control = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("key", item);
            present = Cy_JWT_FindPresentValueInTemplate("key", item);
            if(NULL != def)
            {
                debug_policy->m0p_policy.key = def->valueint;
                debug_policy->present.m0p_policy.key = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        item = Cy_JWT_FindJsonItemByKey("m4", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("permission", item);
            present = Cy_JWT_FindPresentValueInTemplate("permission", item);
            if(NULL != def)
            {
                debug_policy->m4_policy.permission =
                        Cy_JWT_GetPermissionCode((const char *)def->valuestring);
                debug_policy->present.m4_policy.permission = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("control", item);
            present = Cy_JWT_FindPresentValueInTemplate("control", item);
            if(NULL != def)
            {
                debug_policy->m4_policy.control =
                        Cy_JWT_GetControlCode((const char *)def->valuestring);
                debug_policy->present.m4_policy.control = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("key", item);
            present = Cy_JWT_FindPresentValueInTemplate("key", item);
            if(NULL != def)
            {
                debug_policy->m4_policy.key = def->valueint;
                debug_policy->present.m4_policy.key = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        item = Cy_JWT_FindJsonItemByKey("system", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("permission", item);
            present = Cy_JWT_FindPresentValueInTemplate("permission", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.permission =
                        Cy_JWT_GetPermissionCode((const char *)def->valuestring);
                debug_policy->present.sys_policy.permission = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("control", item);
            present = Cy_JWT_FindPresentValueInTemplate("control", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.control =
                        Cy_JWT_GetControlCode((const char *)def->valuestring);
                debug_policy->present.sys_policy.control = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

