dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
            def = Cy_JWT_FindDefaultValueInTemplate("key", item);
            present = Cy_JWT_FindPresentValueInTemplate("key", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.key = def->valueint;
                debug_policy->present.sys_policy.key = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("syscall", item);
            present = Cy_JWT_FindPresentValueInTemplate("syscall", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.syscall = def->type;
                debug_policy->present.sys_policy.syscall = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("mmio", item);
            present = Cy_JWT_FindPresentValueInTemplate("mmio", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.mmio = def->type;
                debug_policy->present.sys_policy.mmio = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("flash", item);
            present = Cy_JWT_FindPresentValueInTemplate("flash", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.flash = def->type;
                debug_policy->present.sys_policy.flash = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("workflash", item);
            present = Cy_JWT_FindPresentValueInTemplate("workflash", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.workflash = def->type;
                debug_policy->present.sys_policy.workflash = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("sflash", item);
            present = Cy_JWT_FindPresentValueInTemplate("sflash", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.sflash = def->type;
                debug_policy->present.sys_policy.sflash = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("sram", item);
            present = Cy_JWT_FindPresentValueInTemplate("sram", item);
            if(NULL != def)
            {
                debug_policy->sys_policy.sram = def->type;
                debug_policy->present.sys_policy.sram = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        item = Cy_JWT_FindJsonItemByKey("rma", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("permission", item);
            present = Cy_JWT_FindPresentValueInTemplate("permission", item);
            if(NULL != def)
            {
                debug_policy->rma_policy.permission =
                        Cy_JWT_GetPermissionCode((const char *)def->valuestring);
                debug_policy->present.rma_policy.permission = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("key", item);
            present = Cy_JWT_FindPresentValueInTemplate("key", item);
            if(NULL != def)
            {
                debug_policy->rma_policy.key = def->valueint;
                debug_policy->present.rma_policy.key = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            array = Cy_JWT_FindJsonItemByKey("destroy_fuses", item);
            if(NULL != array)
            {
                uint32_t start = 0;
                uint32_t size = 0;
                uint8_t startPresent;
                uint8_t sizePresent;

                def = Cy_JWT_FindDefaultValueInTemplate("start", array);
                startPresent = Cy_JWT_FindPresentValueInTemplate("start", array);
                if(NULL != def)
                {
                    start = def->valueint;
                }
                else
                {
                    rc = CY_JWT_ERR_JKEY_NOT_FOUND;
                }

                def = Cy_JWT_FindDefaultValueInTemplate("size", array);
                sizePresent = Cy_JWT_FindPresentValueInTemplate("size", array);
                if(NULL != def)
                {
                    size = def->valueint;
                }
                else
                {
                    rc = CY_JWT_ERR_JKEY_NOT_FOUND;
                }

                for(int i = 0; i < POLICY_MAX_N_OF_DESTR_REGIONS; i++)
                {
                    debug_policy->rma_policy.destroy_fuses[i].size = size;
                    debug_policy->rma_policy.destroy_fuses[i].start = start;
                    debug_policy->present.rma_policy.destroy_fuses[i].size = sizePresent;
                    debug_policy->present.rma_policy.destroy_fuses[i].start = startPresent;
                }
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            array = Cy_JWT_FindJsonItemByKey("destroy_flash", item);
            if(NULL != array)
            {
                uint32_t start = 0;
                uint32_t size = 0;
                uint8_t startPresent;
                uint8_t sizePresent;

                def = Cy_JWT_FindDefaultValueInTemplate("start", array);
                startPresent = Cy_JWT_FindPresentValueInTemplate("start", array);
                if(NULL != def)
                {
                    start = def->valueint;
                }
                else
                {
                    rc = CY_JWT_ERR_JKEY_NOT_FOUND;
                }

                def = Cy_JWT_FindDefaultValueInTemplate("size", array);
                sizePresent = Cy_JWT_FindPresentValueInTemplate("size", array);
                if(NULL != def)
                {
                    size = def->valueint;
                }
                else
                {
                    rc = CY_JWT_ERR_JKEY_NOT_FOUND;
                }

                for(int i = 0; i < POLICY_MAX_N_OF_DESTR_REGIONS; i++)
                {
                    debug_policy->rma_policy.destroy_flash[i].size = size;
                    debug_policy->rma_policy.destroy_flash[i].start = start;
                    debug_policy->present.rma_policy.destroy_flash[i].size = sizePresent;
                    debug_policy->present.rma_policy.destroy_flash[i].start = startPresent;
                }
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

