dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
        cJSON_Delete(schema);
    }
    else
    {
        rc = CY_JWT_ERR_JSN_PARSE_FAIL;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_DefaultWoundingPolicy
****************************************************************************//**
* Set Wounding policy structure to default values using corresponding template
* 
* \param schema_str  Schema policy template with default values.
* \param wounding_policy  Wounding policy to be initialized.
* \return                Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_WoundingPolicySetDefault(const char *schema_str, wound_policy_t *wounding_policy)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *schema = NULL;
    cJSON *item = NULL;
    cJSON *def = NULL;
    uint8_t present;

    cJSON_InitHooks(NULL);

    schema = cJSON_Parse(schema_str);
    if(NULL != schema)
    {
        item = Cy_JWT_FindJsonItemByKey("peripherals", schema);
        if(NULL != item)
        {
            uint32_t id = 0;
            uint32_t base_address = 0;
            uint8_t idPresent;
            uint8_t addrPresent;

            def = Cy_JWT_FindDefaultValueInTemplate("id", item);
            idPresent = Cy_JWT_FindPresentValueInTemplate("id", item);
            if(NULL != def)
            {
                id = def->valueint;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("base_address", item);
            addrPresent = Cy_JWT_FindPresentValueInTemplate("base_address", item);
            if(NULL != def)
            {
                base_address = def->valueint;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            for(int i = 0; i < POLICY_MAX_N_OF_PERIPH; i++)
            {
                wounding_policy->periph_policy[i].id = id;
                wounding_policy->periph_policy[i].base_address = base_address;
                wounding_policy->present.periph_policy[i].id = idPresent;
                wounding_policy->present.periph_policy[i].base_address = addrPresent;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        item = Cy_JWT_FindJsonItemByKey("memories", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("flash", item);
            present = Cy_JWT_FindPresentValueInTemplate("flash", item);
            if(NULL != def)
            {
                wounding_policy->mem_policy.flash = (bool)def->type;
                wounding_policy->present.mem_policy.flash = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("workflash", item);
            present = Cy_JWT_FindPresentValueInTemplate("workflash", item);
            if(NULL != def)
            {
                wounding_policy->mem_policy.workflash = (bool)def->type;
                wounding_policy->present.mem_policy.workflash = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("sflash", item);
            present = Cy_JWT_FindPresentValueInTemplate("sflash", item);
            if(NULL != def)
            {
                wounding_policy->mem_policy.sflash = (bool)def->type;
                wounding_policy->present.mem_policy.sflash = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("sram", item);
            present = Cy_JWT_FindPresentValueInTemplate("sram", item);
            if(NULL != def)
            {
                wounding_policy->mem_policy.sram = def->valueint;
                wounding_policy->present.mem_policy.sram = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        item = Cy_JWT_FindJsonItemByKey("software", schema);
        if(NULL != item)
        {
            uint32_t id = 0;
            uint32_t capability = 0;
            uint8_t id_present;
            uint8_t cap_present;

            def = Cy_JWT_FindDefaultValueInTemplate("id", item);
            id_present = Cy_JWT_FindPresentValueInTemplate("id", item);
            if(NULL != def)
            {
                id = def->valueint;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("capability", item);
            cap_present = Cy_JWT_FindPresentValueInTemplate("capability", item);
            if(NULL != def)
            {
                capability = def->valueint;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            for(int i = 0; i < POLICY_MAX_N_OF_SW; i++)
            {
                wounding_policy->soft_policy[i].id = id;
                wounding_policy->soft_policy[i].capability = capability;
                wounding_policy->present.soft_policy[i].id = id_present;
                wounding_policy->present.soft_policy[i].capability = cap_present;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        cJSON_Delete(schema);
    }
    else
    {
        rc = CY_JWT_ERR_JSN_PARSE_FAIL;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_DefaultBnUPolicy
****************************************************************************//**
* Set Boot & Upgrade policy structure to default values using corresponding template
* 
* \param schema_str  Schema policy template with default values.
* \param bnu_policy  Boot&Upgrade policy to be initialized.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_BnUPolicySetDefault(const char *schema_str, bnu_policy_t *bnu_policy)
{
    int rc = CY_JWT_SUCCESS;
    cJSON *schema = NULL;
    cJSON *item = NULL;
    cJSON *def = NULL;
    uint8_t present;

