dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
    cJSON_InitHooks(NULL);

    schema = cJSON_Parse(schema_str);
    if(NULL != schema)
    {
        item = Cy_JWT_FindJsonItemByKey("firmware", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("id", item);
            present = Cy_JWT_FindPresentValueInTemplate("id", item);
            if(NULL != def)
            {
                bnu_policy->bnu_img_policy.id = def->valueint;
                bnu_policy->present.bnu_img_policy.id = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("upgrade", item);
            present = Cy_JWT_FindPresentValueInTemplate("upgrade", item);
            if(NULL != def)
            {
                bnu_policy->bnu_img_policy.upgrade = (bool)def->type;
                bnu_policy->present.bnu_img_policy.upgrade = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("encrypt", item);
            present = Cy_JWT_FindPresentValueInTemplate("encrypt", item);
            if(NULL != def)
            {
                bnu_policy->bnu_img_policy.encrypt = (bool)def->type;
                bnu_policy->present.bnu_img_policy.encrypt = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("monotonic", item);
            present = Cy_JWT_FindPresentValueInTemplate("monotonic", item);
            if(NULL != def)
            {
                bnu_policy->bnu_img_policy.monotonic = def->valueint;
                bnu_policy->present.bnu_img_policy.monotonic = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("boot_auth", item);
            present = Cy_JWT_FindPresentValueInTemplate("boot_auth", item);
            if(NULL != def)
            {
                for(int i = 0; i < POLICY_MAX_N_OF_KEYS; i++)
                {
                    bnu_policy->bnu_img_policy.boot_auth[i] = def->valueint;
                    bnu_policy->present.bnu_img_policy.boot_auth[i] = present;
                }
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("upgrade_auth", item);
            present = Cy_JWT_FindPresentValueInTemplate("upgrade_auth", item);
            if(NULL != def)
            {
                for(int i = 0; i < POLICY_MAX_N_OF_KEYS; i++)
                {
                    bnu_policy->bnu_img_policy.upgrade_auth[i] = def->valueint;
                    bnu_policy->present.bnu_img_policy.upgrade_auth[i] = present;
                }
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("backup", item);
            present = Cy_JWT_FindPresentValueInTemplate("backup", item);
            if(NULL != def)
            {
                bnu_policy->bnu_img_policy.backup = (bool)def->type;
                bnu_policy->present.bnu_img_policy.backup = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            item = Cy_JWT_FindJsonItemByKey("resources", schema);
            if(NULL != def)
            {
                uint32_t address = 0;
                uint32_t size = 0;
                uint8_t addressPresent;
                uint8_t sizePresent;

                // TODO: need to set it when validating per schema
                bnu_policy->present.bnu_img_policy.boot_area.start = 1;
                bnu_policy->present.bnu_img_policy.boot_area.size = 1;

                bnu_policy->present.bnu_img_policy.upgrade_area.start = 1;
                bnu_policy->present.bnu_img_policy.upgrade_area.size = 1;

                def = Cy_JWT_FindDefaultValueInTemplate("address", item);
                addressPresent = Cy_JWT_FindPresentValueInTemplate("address", item);
                if(NULL != def)
                {
                    address = def->valueint;
                }
                else
                {
                    rc = CY_JWT_ERR_JKEY_NOT_FOUND;
                }

                def = Cy_JWT_FindDefaultValueInTemplate("size", item);
                sizePresent = Cy_JWT_FindPresentValueInTemplate("size", item);
                if(NULL != def)
                {
                    size = def->valueint;
                }
                else
                {
                    rc = CY_JWT_ERR_JKEY_NOT_FOUND;
                }

                for(int i = 0; i < POLICY_MAX_N_OF_PROT_REGIONS; i++)
                {
                    bnu_policy->prot_regions[i].start = address;
                    bnu_policy->prot_regions[i].size = size;
                    bnu_policy->present.prot_regions[i].start = addressPresent;
                    bnu_policy->present.prot_regions[i].size = sizePresent;
                }
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        item = Cy_JWT_FindJsonItemByKey("reprogram", schema);
        if(NULL != item)
        {
            uint32_t start = 0;
            uint32_t size = 0;
            uint8_t startPresent;
            uint8_t sizePresent;

            def = Cy_JWT_FindDefaultValueInTemplate("start", item);
            startPresent = Cy_JWT_FindPresentValueInTemplate("start", item);
            if(NULL != def)
            {
                start = def->valueint;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("size", item);
            sizePresent = Cy_JWT_FindPresentValueInTemplate("size", item);
            if(NULL != def)
            {
                size = def->valueint;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            for(int i = 0; i < POLICY_MAX_N_OF_REPROG_REGIONS; i++)
            {
                bnu_policy->bnu_reprog_policy[i].size = size;
                bnu_policy->bnu_reprog_policy[i].start = start;
                bnu_policy->present.bnu_reprog_policy[i].size = sizePresent;
                bnu_policy->present.bnu_reprog_policy[i].start = startPresent;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

