dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_MCUBOOT/mcuboot/utils/cy_jwt/cy_jwt_policy.c
        item = Cy_JWT_FindJsonItemByKey("reprovision", schema);
        if(NULL != item)
        {
            def = Cy_JWT_FindDefaultValueInTemplate("keys_and_policies", item);
            present = Cy_JWT_FindPresentValueInTemplate("keys_and_policies", item);
            if(NULL != def)
            {
                bnu_policy->bnu_reprov_policy.keys_n_pol = def->type;
                bnu_policy->present.bnu_reprov_policy.keys_n_pol = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }

            def = Cy_JWT_FindDefaultValueInTemplate("boot_loader", item);
            present = Cy_JWT_FindPresentValueInTemplate("boot_loader", item);
            if(NULL != def)
            {
                bnu_policy->bnu_reprov_policy.boot_loader = (bool)def->type;
                bnu_policy->present.bnu_reprov_policy.boot_loader = present;
            }
            else
            {
                rc = CY_JWT_ERR_JKEY_NOT_FOUND;
            }
        }
        else
        {
            rc = CY_JWT_ERR_JKEY_NOT_FOUND;
        }

        cJSON_Delete(schema);
    }
    else
    {
        rc = CY_JWT_ERR_JSN_PARSE_FAIL;
    }

    return rc;
}

/*******************************************************************************
* Function Name: Cy_JWT_GetProvisioningDetails
****************************************************************************//**
* Read provisioning packet (JWT), policy templates or public keys strings in
* JSON format.
*
* \param id          Item id (provisioning packet, templates or public keys).
* \param ptr         Pointer to the response string.
* \param len         Length of the response string.
* \return            Result of operation: 0 if success, errorcode otherwise.
*******************************************************************************/
int Cy_JWT_GetProvisioningDetails(uint32_t id, char **ptr, uint32_t *len)
{
    int rc = -1;
    volatile uint32_t syscallCmd[2];
    volatile uint32_t syscallParam[2];
    uint32_t timeout = 0;

    syscallCmd[0] = PROVDETAIL_SYSCALL_OPCODE;
    syscallCmd[1] = (uint32_t)syscallParam;

    syscallParam[0] = id;
    syscallParam[1] = 0;

    IPC->STRUCT[CY_IPC_CHAN_SYSCALL].DATA =  (uint32_t)syscallCmd;

    while(((IPC->STRUCT[CY_IPC_CHAN_SYSCALL].ACQUIRE &
            IPC_STRUCT_ACQUIRE_SUCCESS_Msk) == 0) &&
            (timeout < SYSCALL_TIMEOUT))
    {
        ++timeout;
    }

    if(timeout < SYSCALL_TIMEOUT)
    {
        timeout = 0;

        IPC->STRUCT[CY_IPC_CHAN_SYSCALL].NOTIFY = 1;

        while(((IPC->STRUCT[CY_IPC_CHAN_SYSCALL].LOCK_STATUS &
                IPC_STRUCT_ACQUIRE_SUCCESS_Msk) != 0) &&
                (timeout < SYSCALL_TIMEOUT))
        {
            ++timeout;
        }

        if(timeout < SYSCALL_TIMEOUT)
        {
            if(CY_FB_SYSCALL_SUCCESS != syscallCmd[0])
            {
                rc = syscallCmd[0];
            }
            else
            {
                *len = syscallParam[0];
                *ptr = (char*)syscallParam[1];
                rc = 0;
            }
        }
    }

    return rc;
}
